# 3.0 Pandas

### Good reference:

[Pandas Documentation](http://pandas.pydata.org/pandas-docs/stable/index.html)

In [2]:
import pandas as pd

import numpy as np

In [44]:
s = pd.Series([1,3,5,np.nan,6,8])
s
#float because of the nan

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [45]:
s = pd.Series([1,3,5,0,6,8])
s

0    1
1    3
2    5
3    0
4    6
5    8
dtype: int64

### Data Frame

In [51]:
dates = pd.date_range('20180501', periods=6)
dates

DatetimeIndex(['2018-05-01', '2018-05-02', '2018-05-03', '2018-05-04',
               '2018-05-05', '2018-05-06'],
              dtype='datetime64[ns]', freq='D')

In [52]:
dates1 = pd.date_range('20180501', periods=6, freq='W-MON')
dates1

DatetimeIndex(['2018-05-07', '2018-05-14', '2018-05-21', '2018-05-28',
               '2018-06-04', '2018-06-11'],
              dtype='datetime64[ns]', freq='W-MON')

In [55]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2018-05-01  0.481016  1.675912  0.394839 -0.008451
2018-05-02 -0.545258 -0.056680  0.395455 -0.203042
2018-05-03 -1.181007  0.721598 -0.923762  2.203624
2018-05-04  0.111885  1.271961  0.256533  0.515110
2018-05-05  0.167895  0.053903  0.610575 -0.620919
2018-05-06  1.964214  0.347219 -1.981952 -0.264981

In [59]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' }) # object

df2

# univariate: one variable
# multivariate: many variables

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [60]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

### try:

type df2. and then press tab

In [61]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [8]:
df2.isnull()

       A      B      C      D      E      F
0  False  False  False  False  False  False
1  False  False  False  False  False  False
2  False  False  False  False  False  False
3  False  False  False  False  False  False

### Viewing Data

In [62]:
df

                   A         B         C         D
2018-05-01  0.481016  1.675912  0.394839 -0.008451
2018-05-02 -0.545258 -0.056680  0.395455 -0.203042
2018-05-03 -1.181007  0.721598 -0.923762  2.203624
2018-05-04  0.111885  1.271961  0.256533  0.515110
2018-05-05  0.167895  0.053903  0.610575 -0.620919
2018-05-06  1.964214  0.347219 -1.981952 -0.264981

In [10]:
df.head() # 5 by default

                   A         B         C         D
2018-05-01 -0.136816  1.053772 -1.080220 -0.891702
2018-05-02  0.307539 -0.604560  0.083288 -1.344013
2018-05-03 -0.258059  0.253438 -1.051720  1.580398
2018-05-04 -0.270000 -0.374987  0.093251  0.874281
2018-05-05 -1.296546  0.520760 -0.057945 -1.521722

In [63]:
df.head(2)

                   A         B         C         D
2018-05-01  0.481016  1.675912  0.394839 -0.008451
2018-05-02 -0.545258 -0.056680  0.395455 -0.203042

In [65]:
df.tail()

                   A         B         C         D
2018-05-02 -0.545258 -0.056680  0.395455 -0.203042
2018-05-03 -1.181007  0.721598 -0.923762  2.203624
2018-05-04  0.111885  1.271961  0.256533  0.515110
2018-05-05  0.167895  0.053903  0.610575 -0.620919
2018-05-06  1.964214  0.347219 -1.981952 -0.264981

In [64]:
df.tail(2)

                   A         B         C         D
2018-05-05  0.167895  0.053903  0.610575 -0.620919
2018-05-06  1.964214  0.347219 -1.981952 -0.264981

In [66]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

### data aggregation

In [67]:
df.describe()

# normal distribution mean is 0, std is 1
# real life data has different mean & std, that's why we have to know to preprocess it.
# to determine outliers, to replace missing values, etc.

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.166457  0.668985 -0.208052  0.270223
std    1.063584  0.691187  1.026903  1.017863
min   -1.181007 -0.056680 -1.981952 -0.620919
25%   -0.380973  0.127232 -0.628688 -0.249496
50%    0.139890  0.534408  0.325686 -0.105747
75%    0.402736  1.134370  0.395301  0.384220
max    1.964214  1.675912  0.610575  2.203624

### Transpose your data

In [68]:
df.T

   2018-05-01  2018-05-02  2018-05-03  2018-05-04  2018-05-05  2018-05-06
A    0.481016   -0.545258   -1.181007    0.111885    0.167895    1.964214
B    1.675912   -0.056680    0.721598    1.271961    0.053903    0.347219
C    0.394839    0.395455   -0.923762    0.256533    0.610575   -1.981952
D   -0.008451   -0.203042    2.203624    0.515110   -0.620919   -0.264981

In [69]:
df['C']

2018-05-01    0.394839
2018-05-02    0.395455
2018-05-03   -0.923762
2018-05-04    0.256533
2018-05-05    0.610575
2018-05-06   -1.981952
Freq: D, Name: C, dtype: float64

In [70]:
df.C

2018-05-01    0.394839
2018-05-02    0.395455
2018-05-03   -0.923762
2018-05-04    0.256533
2018-05-05    0.610575
2018-05-06   -1.981952
Freq: D, Name: C, dtype: float64

### Sorting by an axis

In [76]:
# axis 0 = row, 1= 
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2018-05-01 -0.008451  0.394839  1.675912  0.481016
2018-05-02 -0.203042  0.395455 -0.056680 -0.545258
2018-05-03  2.203624 -0.923762  0.721598 -1.181007
2018-05-04  0.515110  0.256533  1.271961  0.111885
2018-05-05 -0.620919  0.610575  0.053903  0.167895
2018-05-06 -0.264981 -1.981952  0.347219  1.964214

In [77]:
df.sort_index(axis=1, ascending=True)

                   A         B         C         D
2018-05-01  0.481016  1.675912  0.394839 -0.008451
2018-05-02 -0.545258 -0.056680  0.395455 -0.203042
2018-05-03 -1.181007  0.721598 -0.923762  2.203624
2018-05-04  0.111885  1.271961  0.256533  0.515110
2018-05-05  0.167895  0.053903  0.610575 -0.620919
2018-05-06  1.964214  0.347219 -1.981952 -0.264981

In [78]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2018-05-06  1.964214  0.347219 -1.981952 -0.264981
2018-05-05  0.167895  0.053903  0.610575 -0.620919
2018-05-04  0.111885  1.271961  0.256533  0.515110
2018-05-03 -1.181007  0.721598 -0.923762  2.203624
2018-05-02 -0.545258 -0.056680  0.395455 -0.203042
2018-05-01  0.481016  1.675912  0.394839 -0.008451

In [79]:
df.A

2018-05-01    0.481016
2018-05-02   -0.545258
2018-05-03   -1.181007
2018-05-04    0.111885
2018-05-05    0.167895
2018-05-06    1.964214
Freq: D, Name: A, dtype: float64

### indexing and selecting data

In [80]:
dates = pd.date_range('1/5/2018', periods=8)
df3 = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])
df3

                   A         B         C         D
2018-01-05 -0.088858 -0.857487  1.359689  1.956336
2018-01-06  0.268845  0.409558 -2.261308 -1.286898
2018-01-07  0.588360 -0.636477  1.424968 -0.280422
2018-01-08 -0.410388  0.308866 -1.271197 -1.364545
2018-01-09 -0.601875  0.781629 -0.101454  0.217445
2018-01-10  0.135019 -0.747559 -0.464753 -0.744558
2018-01-11 -1.483728  0.029730  0.790363  0.509447
2018-01-12 -0.803079  0.174203  0.295298  1.389892

In [81]:
s = df3['A']
s

2018-01-05   -0.088858
2018-01-06    0.268845
2018-01-07    0.588360
2018-01-08   -0.410388
2018-01-09   -0.601875
2018-01-10    0.135019
2018-01-11   -1.483728
2018-01-12   -0.803079
Freq: D, Name: A, dtype: float64

In [82]:
s[dates[5]]

0.13501887766293552

### Note:

loc: selection by label

iloc: selection by position (location/index)

In [84]:
df3.iloc[5]

A    0.135019
B   -0.747559
C   -0.464753
D   -0.744558
Name: 2018-01-10 00:00:00, dtype: float64

In [85]:
df3[:4]

                   A         B         C         D
2018-01-05 -0.088858 -0.857487  1.359689  1.956336
2018-01-06  0.268845  0.409558 -2.261308 -1.286898
2018-01-07  0.588360 -0.636477  1.424968 -0.280422
2018-01-08 -0.410388  0.308866 -1.271197 -1.364545

In [92]:
print(df3[2:4])
print(df3.iloc[2:4])
#stringpoint:endpoint (endpoint = m-1) - endpoint excluded.

print(df3.loc[:,['B', 'A']])
# [row, column]

                   A         B         C         D
2018-01-07  0.588360 -0.636477  1.424968 -0.280422
2018-01-08 -0.410388  0.308866 -1.271197 -1.364545
                   A         B         C         D
2018-01-07  0.588360 -0.636477  1.424968 -0.280422
2018-01-08 -0.410388  0.308866 -1.271197 -1.364545
                   B         A
2018-01-05 -0.857487 -0.088858
2018-01-06  0.409558  0.268845
2018-01-07 -0.636477  0.588360
2018-01-08  0.308866 -0.410388
2018-01-09  0.781629 -0.601875
2018-01-10 -0.747559  0.135019
2018-01-11  0.029730 -1.483728
2018-01-12  0.174203 -0.803079

In [88]:
print(df3.loc[2:4])

TypeError: cannot do slice indexing on DatetimeIndex with these indexers [2] of type int

In [93]:
print(df3.loc['2018-01-07':'2018-01-08'])

                   A         B         C         D
2018-01-07  0.588360 -0.636477  1.424968 -0.280422
2018-01-08 -0.410388  0.308866 -1.271197 -1.364545

In [105]:
df4 = pd.DataFrame(np.random.randn(6,4),
                   index=list('abcdef'),
                   columns=list('ABCD'))

df4

          A         B         C         D
a  0.146860  1.052246  1.581829  0.149371
b -1.791552 -1.641207 -0.273244  1.498009
c -0.235381 -0.593189  0.312513 -1.977474
d  1.455757  1.845392  0.200602 -0.133385
e -0.455358  0.587551 -0.054720 -0.497836
f -0.499360  0.679698  0.327516  0.291077

In [106]:
df4.loc[['a', 'b', 'd'], :]

          A         B         C         D
a  0.146860  1.052246  1.581829  0.149371
b -1.791552 -1.641207 -0.273244  1.498009
d  1.455757  1.845392  0.200602 -0.133385

In [107]:
df4.loc['d':, 'A':'C']

          A         B         C
d  1.455757  1.845392  0.200602
e -0.455358  0.587551 -0.054720
f -0.499360  0.679698  0.327516

### Boolean indexing

In [108]:
df4_with_NA = df4[df4 > 0]
df4_with_NA

          A         B         C         D
a  0.146860  1.052246  1.581829  0.149371
b       NaN       NaN       NaN  1.498009
c       NaN       NaN  0.312513       NaN
d  1.455757  1.845392  0.200602       NaN
e       NaN  0.587551       NaN       NaN
f       NaN  0.679698  0.327516  0.291077

# Missing Data

In [113]:
pd.isnull(df4_with_NA)

       A      B      C      D
a  False  False  False  False
b   True   True   True  False
c   True   True  False   True
d  False  False  False   True
e   True  False   True   True
f   True  False  False  False

In [114]:
df4_with_NA.dropna(how='any') # note, it will drop row(s) with NA elements

         A         B         C         D
a  0.14686  1.052246  1.581829  0.149371

In [117]:
df4_with_NA.mean()

# we could use the mean to replace NaN
# since in this case dropping missing value is not suitable

A    0.801308
B    1.041222
C    0.605615
D    0.646152
dtype: float64

### Adding a column

In [118]:
df4

          A         B         C         D
a  0.146860  1.052246  1.581829  0.149371
b -1.791552 -1.641207 -0.273244  1.498009
c -0.235381 -0.593189  0.312513 -1.977474
d  1.455757  1.845392  0.200602 -0.133385
e -0.455358  0.587551 -0.054720 -0.497836
f -0.499360  0.679698  0.327516  0.291077

In [119]:
df4['E']=np.arange(6)

df4

          A         B         C         D  E
a  0.146860  1.052246  1.581829  0.149371  0
b -1.791552 -1.641207 -0.273244  1.498009  1
c -0.235381 -0.593189  0.312513 -1.977474  2
d  1.455757  1.845392  0.200602 -0.133385  3
e -0.455358  0.587551 -0.054720 -0.497836  4
f -0.499360  0.679698  0.327516  0.291077  5

### Grouping

In [120]:
df5 = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                           'foo', 'bar', 'foo', 'foo'],
                    'B' : ['one', 'one', 'two', 'three',
                           'two', 'two', 'one', 'three'],
                    'C' : np.random.randn(8),
                    'D' : np.random.randn(8)})

df5

# multivariate, cuz have many types of variables

     A      B         C         D
0  foo    one -1.094099 -1.738192
1  bar    one -0.612258  0.309491
2  foo    two -0.351516 -0.038330
3  bar  three  0.285607  0.186315
4  foo    two  0.235168 -1.553506
5  bar    two  0.644480  1.861867
6  foo    one -1.079990  0.837138
7  foo  three  0.772721  0.782115

In [121]:
df5.groupby('A').mean()

            C         D
A
bar  0.105943  0.785891
foo -0.303543 -0.342155

In [122]:
df5.groupby(['A','B']).mean()

                  C         D
A   B
bar one   -0.612258  0.309491
    three  0.285607  0.186315
    two    0.644480  1.861867
foo one   -1.087045 -0.450527
    three  0.772721  0.782115
    two   -0.058174 -0.795918

### writing to a csv file

In [123]:
df5.to_csv('my_csv.csv')

### reading from a csv file

In [124]:
pd.read_csv('my_csv.csv')

   Unnamed: 0    A      B         C         D
0           0  foo    one -1.094099 -1.738192
1           1  bar    one -0.612258  0.309491
2           2  foo    two -0.351516 -0.038330
3           3  bar  three  0.285607  0.186315
4           4  foo    two  0.235168 -1.553506
5           5  bar    two  0.644480  1.861867
6           6  foo    one -1.079990  0.837138
7           7  foo  three  0.772721  0.782115

In [125]:
dfwiki = pd.read_html('http://en.wikipedia.org/wiki/List_of_tallest_buildings_and_structures_in_the_world', header=0, parse_dates=False)
dfwiki

[Empty DataFrame
 Columns: [Unnamed: 0, This article includes a list of general references, but it lacks sufficient corresponding inline citations. Please help to improve this article by introducing more precise citations. (September 2017) (Learn how and when to remove this template message)]
 Index: [],
             Map all coordinates using: OpenStreetMap
 0  Download coordinates as: KML GPX (all coordina...,
 Empty DataFrame
 Columns: [Unnamed: 0, This section needs additional citations for verification. Please help improve this article by adding citations to reliable sources in this section. Unsourced material may be challenged and removed. (August 2007) (Learn how and when to remove this template message)]
 Index: [],
                                       Category  \
 0                           Building[4] (list)
 1                              Compliant tower
 2              Self-supporting tower[5] (list)
 3                     Guyed steel lattice mast
 4                        Hyperboloid structure
 5     Clock tower (multi-functional structure)
 6              Self-supporting tower[5] (list)
 7                        Fixed steel structure
 8                              Moveable object
 9                                Mast radiator
 10                               Twin building
 11                           Steel building[6]
 12                                       Radar
 13                       Partially guyed tower
 14                           Electricity pylon
 15                       Partially guyed tower
 16                                      Bridge
 17  Blaw-Knox tower (diamond cantilever tower)
 18                              Steel Building
 19                       Landmark Tower design
 20                         Elevator test tower
 21                                Wind turbine
 22                                     Minaret
 23                           Solar power tower
 24                                Ferris wheel
 25                             Crane (machine)
 26                Aerial tramway support tower
 27                                  Jackup rig
 28                               Cooling tower
 29                                    Flagpole
 30                                    Monument
 31                                 Water tower
 32                                      Statue
 33                               Masonry tower
 34                          Inclined structure
 35                                     Obelisk
 36                      Power station building
 37                            Masonry building
 38                                Church tower
 39                             Industrial hall
 40                              Memorial cross
 41                   Air traffic control tower
 42                          Tallest swing ride
 43                              Roller coaster
 44                                        Tomb
 45                                  Drop tower
 46                                Gantry crane
 47                                       Stupa
 48                            Wooden structure
 49                                Storage silo
 50                                   Gasometer
 51                  Vertical axis wind turbine
 52     Clock tower (single function structure)
 53                             Wooden building
 54                                      Sphere
 55                                  Lighthouse
 56                                     Gopuram
 57                               Loam building

                                             Structure               Country  \
 0                                        Burj Khalifa  United Arab Emirates
 1                            Petronius (oil platform)         United States
 2                                       Tokyo Skytree                 Japan
 3                                        KVLY-TV mast         United States
 4                                        Canton Tower                 China
 5                                       Abraj Al Bait          Saudi Arabia
 6                                     Ostankino Tower    Russian Federation
 7                           Bullwinkle (oil platform)         United States
 8                                    Troll A platform                Norway
 9                           Lualualei VLF transmitter         United States
 10                               Petronas Twin Towers              Malaysia
 11                                       Willis Tower         United States
 12                              Dimona Radar Facility                Israel
 13                                  Indosiar TV Tower             Indonesia
 14               Jintang-Cezi Overhead Powerline Link                 China
 15                                    Gerbrandy Tower           Netherlands
 16                                     Millau Viaduct                France
 17                                     Lakihegy Tower               Hungary
 18                                          The Shard        United Kingdom
 19                                         Star Tower         United States
 20                                           H1 Tower                 Japan
 21                                Haliade-X Prototype           Netherlands
 22                                  Djamaa el Djazar               Algeria
 23          Mohammed bin Rashid Al Maktoum Solar Park  United Arab Emirates
 24                                          Ain Dubai                   UAE
 25                                        LR 13000[7]               Germany
 26             Cat Hai  Phu Long cable car towers[8]               Vietnam
 27                               Noble Lloyd Noble[9]               Liberia
 28                             Pingshan Power Station                 China
 29                                     Cairo Flagpole                 Egypt
 30                                       Gateway Arch         United States
 31                        Main tower of Kuwait Towers                Kuwait
 32                                    Statue of Unity                 India
 33                             Anaconda Smelter Stack         United States
 34                                    Olympic Stadium                Canada
 35                               San Jacinto Monument         United States
 36                         Niederaussem Power Station               Germany
 37                                  Mole Antonelliana                 Italy
 38                                      Ulmer Mnster               Germany
 39                          Vehicle Assembly Building         United States
 40                 Santa Cruz del Valle de los Cados                 Spain
 41  Kuala Lumpur International Airport 2 Control T...              Malaysia
 42                             Bollywood Skyflyer[12]  United Arab Emirates
 43                                          Kingda Ka         United States
 44                              Great Pyramid of Giza                 Egypt
 45                            Zumanjaro: Drop of Doom         United States
 46                                      Kockums Crane           South Korea
 47                                     Jetavanaramaya             Sri Lanka
 48                                Gliwice Radio Tower                Poland
 49                                    Swissmill Tower           Switzerland
 50                               Gasometer Oberhausen               Germany
 51                                           ole[13]                Canada
 52            Joseph Chamberlain Memorial Clock Tower        United Kingdom
 53                                         Mjstrnet                Norway
 54                                       Avicii Arena                Sweden
 55                              le Vierge Lighthouse                France
 56                                Murudeshwara Temple                 India
 57                                Weilburg Pis House               Germany

                          Location Height (meters)  Height (feet)  Year built  \
 0                           Dubai           829.8       2722.000        2010
 1                  Gulf of Mexico             640       2100.000        2000
 2                           Tokyo             634       2080.000        2011
 3         Blanchard, North Dakota             629       2063.000        1963
 4                       Guangzhou             604       1982.000        2010
 5                           Mecca             601       1972.000        2012
 6                          Moscow             540       1772.000        1967
 7                  Gulf of Mexico             529       1736.000        1988
 8                       North Sea             472       1549.000        1996
 9               Lualualei, Hawaii             458       1503.000        1972
 10                   Kuala Lumpur             452       1483.000        1998
 11              Chicago, Illinois             442       1450.000        1974
 12                         Dimona             400       1312.000        2008
 13                        Jakarta             395       1296.000        2006
 14                 Jintang Island             380       1247.000        2019
 15                    IJsselstein           366.8       1203.000        1961
 16                         Millau             342       1122.000        2004
 17              Szigetszentmikls             314       1031.000        1946
 18                         London             309       1016.000        2012
 19                     Cincinnati             291        954.000        1991
 20                      Guangzhou           273.8        898.000        2020
 21                      Rotterdam             270        886.000        2019
 22                        Algiers             265        870.000        2019
 23                  Saih Al-Dahal             262        860.000        2020
 24         Bluewater Island Dubai             250        820.000        2021
 25                            NaN             248        814.000        2013
 26                        H Long           214.8        704.000        2020
 27                            NaN             214        702.000        2016
 28                        Huaibei             210        689.000        2020
 29     New Administrative Capital     201.952[10]        662.572        2021
 30            St. Louis, Missouri             192        630.000        1965
 31                    Kuwait City             187        614.000        1979
 32      Narmada district, Gujarat             182        597.000        2018
 33              Anaconda, Montana           178.3        585.000        1919
 34                       Montreal             175        574.000        1976
 35                La Porte, Texas           173.7        570.000        1939
 36                       Bergheim             172        564.000        2002
 37                         Torino           167.5        550.000        1889
 38                            Ulm             162        530.000        1890
 39  Kennedy Space Center, Florida             160        525.000        1966
 40                    El Escorial           152.4        500.000        1957
 41                         Sepang           141.3        463.600    2013[11]
 42                          Dubai             140        460.000        2021
 43            Jackson, New Jersey          138.98        456.000        2005
 44                           Giza           138.8        455.200    2560 BCE
 45           Jackson Township, NJ             139        456.000        2014
 46                          Ulsan             138        453.000        1974
 47                   Anuradhapura             122        400.000  273301 CE
 48                        Gliwice             118        387.000        1935
 49                         Zurich             118        387.000        2016
 50                     Oberhausen           117.5        386.000        1929
 51                       Gaspsie             110        361.000        1987
 52                     Birmingham             100        328.000        1908
 53                     Brumunddal            85.4        280.000        2019
 54                      Stockholm              85        279.000        1989
 55                      Finistre            82.5        271.000        1902
 56                   Murudeshwara              76        249.000        2008
 57                       Weilburg            23.2         76.000        1828

                                           Coordinates
 0   .mw-parser-output .geo-default,.mw-parser-outp...
 1     290630N 875630W / 29.10833N 87.94167W
 2   354236.5N 1394839E / 35.710139N 139.8...
 3     472032N 971721W / 47.34222N 97.28917W
 4     23632N 113198E / 23.10889N 113.31889E
 5     212508N 394935E / 21.41889N 39.82639E
 6                               554911N 373642E
 7     275301N 905404W / 27.88361N 90.90111W
 8                 6040N 340E / 60.667N 3.667E
 9   212511.87N 1580853.67W / 21.4199639N ...
 10  30927.45N 1014240.7E / 3.1576250N 101...
 11      415244N 873809W / 41.8789N 87.6358W
 12  30586.93N 350549.64E / 30.9685917N 35...
 13  61137.95S 106465.59E / 6.1938750S 106...
 14  30050.88N 1215310.5E / 30.0835778N 12...
 15  520036.24N 050312.87E / 52.0100667N 5...
 16  440509.97N 030117.94E / 44.0861028N 3...
 17    472223N 190016E / 47.37306N 19.00444E
 18  51309.59N 0057.20E / 51.5026639N 0.08...
 19    391201N 843122W / 39.20028N 84.52278W
 20  230103N 1131730E / 23.01750N 113.29167E
 21  515744.8N 4041.96E / 51.962444N 4.011...
 22      364409N 30817E / 36.73583N 3.13806E
 23       244517N 552154E / 24.7547N 55.365E
 24                                                NaN
 25                                          (movable)
 26                                                NaN
 27                                          (movable)
 28  334953.7N 1164939.7E / 33.831583N 116...
 29                                                NaN
 30  383728.62N 90115.87W / 38.6246167N 90...
 31  292322.75N 480011.57E / 29.3896528N 4...
 32      215017N 734309E / 21.8380N 73.7191E
 33  460636.53N 1125448.8W / 46.1101472N 1...
 34  453333.53N 73337.61W / 45.5593139N 73...
 35  294459.46N 950450.52W / 29.7498500N 9...
 36     505944N 064009E / 50.99556N 6.66917E
 37  45048.45N 74135.62E / 45.0690139N 7.6...
 38  482355N 95930.78E / 48.39861N 9.99188...
 39  28359.64N 80392.11W / 28.5860111N 80....
 40  403831.46N 4919.6W / 40.6420722N 4.15...
 41  24426N 1014045E / 2.740486N 101.679069E
 42    2550.0N 55180E / 25.083333N 55.30000E
 43  400826.54N 742559.83W / 40.1407056N 7...
 44  295844.93N 31083.09E / 29.9791472N 31...
 45  400826N 742601W / 40.140623N 74.433543W
 46                                                NaN
 47      82106N 802413E / 8.35167N 80.40361E
 48  501848.12N 184120.26E / 50.3133667N 1...
 49    472323N 83138E / 47.389628N 8.527086E
 50     Currently used as an exhibition and event hall
 51    490435N 664406W / 49.07639N 66.73500W
 52        522700N 15551W / 52.4499N 1.9307W
 53    605238N 105551E / 60.87722N 10.93083E
 54  591736.92N 180458.79E / 59.2935889N 1...
 55                                                NaN
 56  140539.11N 74296.59E / 14.0941972N 74...
 57  502913.28N 81534.11E / 50.4870222N 8....  ,
                                Category                     Structure  \
 0                            Guyed mast             Warsaw Radio Mast
 1             Scientific research tower                    BREN Tower
 2              Guyed tubular steel mast  Shushi-Wan Omega Transmitter
 3   Structure for scientific experiment             Smokey Shot Tower
 4                   Solar updraft tower      Manzanares Solar Chimney
 5                      Wooden structure    Mhlacker Wood Radio Tower
 6                      Masonry building             Mole Antonelliana
 7           Pre-Industrial era building             Lincoln Cathedral
 8                             Telescope             Arecibo Telescope
 9                             Gasometer     Gasometer Zeche Nordstern
 10                         Storage silo                Henninger Turm

            Country              Location  Height (metres)  Height (feet)  \
 0           Poland                 Gbin           646.38         2121.0
 1    United States      Nevada Test Site           462.00         1516.0
 2            Japan              Tsushima           389.00         1276.0
 3    United States      Nevada Test Site           213.00          700.0
 4            Spain            Manzanares           195.00          640.0
 5          Germany             Mhlacker           190.00          623.0
 6            Italy                 Turin           167.50          549.5
 7   United Kingdom               Lincoln           160.00          524.0
 8      Puerto Rico  Arecibo, Puerto Rico           150.00          492.0
 9          Germany         Gelsenkirchen           147.00          482.0
 10         Germany             Frankfurt           120.00          394.0

                                           Coordinates  \
 0   52223.74N 19488.73E / 52.3677056N 19....
 1   364650.23N 1161436.9W / 36.7806194N 1...
 2   343653N 1292713E / 34.61472N 129.45361E
 3   371113.63N 11647.93W / 37.1871194N 11...
 4   390234.45N 31512.21W / 39.0429028N 3....
 5   485627.67N 8518.24E / 48.9410194N 8.8...
 6   45048.45N 74135.62E / 45.0690139N 7.6...
 7   53143.26N 03210.54W / 53.2342389N 0.5...
 8     182039N 664510W / 18.34417N 66.75278W
 9                                                 NaN
 10  500550.18N 84136.81E / 50.0972722N 8....

                                               Remarks
 0      Completed in 1974, collapsed on August 8, 1991
 1      Completed in 1962, demolished May 23, 2012[14]
 2               Completed in 1973, dismantled in 1998
 3   Guyed mast, which carried 44 kt yield nuclear ...
 4   Completed in 1982, the tower's guy-wires were ...
 5   Completed in 1934, destroyed on April 6, 1945,...
 6   Spire destroyed by a tornado in 1953 (rebuilt ...
 7          Completed in 1311, spire blown off in 1549
 8    Completed in 1963, collapsed on December 1, 2020
 9   Completed in 1938, damaged at an air raid on M...
 10            Constructed in 1961, demolished in 2013  ,
                      Category                                       Structure  \
 0                    Category                                       Structure
 1                  Mixed-use*                                    Burj Khalifa
 2                  Industrial                        Petronius (oil platform)
 3                      Office                          Ping An Finance Center
 4                 Residential                              Central Park Tower
 5                    Military                  Large masts of INS Kattabomman
 6                       Hotel                                Gevora Hotel[15]
 7   Scientific research tower                   Amazon Tall Tower Observatory
 8                 Educational                         Moscow State University
 9                   Religious                               Djamaa el Djazar
 10                   Hospital   Outpatient Center, Houston Methodist Hospital
 11               Air cleaning  Xi'an air purification tower (HSALSCS)[17][18]

                  Country                 Location Architectural top  \
 0                Country                 Location          (metres)
 1   United Arab Emirates                    Dubai               830
 2          United States           Gulf of Mexico               640
 3                  China                 Shenzhen               555
 4          United States            New York City             472.4
 5                  India  Tirunelveli, Tamil Nadu               471

In [127]:
tallest = dfwiki[3]  
tallest.head()

,Category,Structure,Country,Location,Height (meters),Height (feet),Year built,Coordinates
0,Building[4] (list),Burj Khalifa,United Arab Emirates,Dubai,829.8,2722.0,2010,".mw-parser-output .geo-default,.mw-parser-outp..."
1,Compliant tower,Petronius (oil platform),United States,Gulf of Mexico,640,2100.0,2000,290630N 875630W / 29.10833N 87.94167W
2,Self-supporting tower[5] (list),Tokyo Skytree,Japan,Tokyo,634,2080.0,2011,354236.5N 1394839E / 35.710139N 139.8...
3,Guyed steel lattice mast,KVLY-TV mast,United States,"Blanchard, North Dakota",629,2063.0,1963,472032N 971721W / 47.34222N 97.28917W
4,Hyperboloid structure,Canton Tower,China,Guangzhou,604,1982.0,2010,23632N 113198E / 23.10889N 113.31889E

# Exercise

In [162]:
ufo = pd.read_csv('ufo.csv')

ufo

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59

### Q1:

show the top 5 rows of data

In [163]:
ufo.head(5)

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

### Q2: 
show the last 10 rows of data

In [164]:
ufo.tail(10)

                 City Colors Reported Shape Reported State              Time
18231     Pismo Beach             NaN           OVAL    CA  12/31/2000 20:00
18232            Lodi             NaN            NaN    WI  12/31/2000 20:30
18233       Anchorage             RED        VARIOUS    AK  12/31/2000 21:00
18234        Capitola             NaN       TRIANGLE    CA  12/31/2000 22:00
18235  Fountain Hills             NaN            NaN    AZ  12/31/2000 23:00
18236      Grant Park             NaN       TRIANGLE    IL  12/31/2000 23:00
18237     Spirit Lake             NaN           DISK    IA  12/31/2000 23:00
18238     Eagle River             NaN            NaN    WI  12/31/2000 23:45
18239     Eagle River             RED          LIGHT    WI  12/31/2000 23:45
18240            Ybor             NaN           OVAL    FL  12/31/2000 23:59

### Q3:

check the data type

In [165]:
type(ufo)

pandas.core.frame.DataFrame

### Q4:

#show all rows for the column 'City' , and the unique cities

In [166]:
ufo['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [167]:
pd.Series(ufo['City'].unique(), name='City')

0                     Ithaca
1                Willingboro
2                    Holyoke
3                    Abilene
4       New York Worlds Fair
                ...
6472          Albrightsville
6473                 Eufaula
6474                Capitola
6475              Grant Park
6476                    Ybor
Name: City, Length: 6477, dtype: object

### Q5: 
determine the shape (dimension) of the data

In [168]:
ufo.shape

(18241, 5)

### Q6:
show all data for 'City' that starts with 'E'

In [169]:
ufo[ufo['City'].str.startswith('E', na=False)]

                 City Colors Reported Shape Reported State              Time
8             Eklutna             NaN          CIGAR    AK  10/15/1936 17:00
55           Espanola             NaN         CIRCLE    NM    6/1/1947 17:00
109         Excelsior             NaN         CIRCLE    MN    8/15/1949 0:00
140    East Palestine             NaN          LIGHT    OH   7/10/1950 20:30
179         Evergreen             NaN           DISK    CO    6/6/1952 13:00
...               ...             ...            ...   ...               ...
18182      Evansville             NaN       FIREBALL    IN  12/24/2000 20:00
18215        El Campo             NaN          OTHER    TX   12/29/2000 9:00
18224         Eufaula             NaN           DISK    OK  12/29/2000 23:30
18238     Eagle River             NaN            NaN    WI  12/31/2000 23:45
18239     Eagle River             RED          LIGHT    WI  12/31/2000 23:45

[557 rows x 5 columns]

### Q7:

count the number of reported cases for 'LIGHT'

In [170]:
ufo[ufo['Shape Reported'] == 'LIGHT'].shape[0]

2803

### Q8

count the number of shape reported, group by state and city

In [171]:
ufo.groupby(['State', 'City'])['Shape Reported'].count()

State  City
AK     Adak                          1
       Alaska                        2
       Anchorage                    12
       Arctic                        1
       Auke Bay                      2
                                    ..
WY     Ten Sleep                     1
       Wheeling                      0
       Wyoming                       2
       Yellowstone National Park     1
       Yellowstone Park              1
Name: Shape Reported, Length: 8029, dtype: int64